# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2024/7/27 下午9:52   
# @Author  : 李清水            
# @File    : ws2812_driver.py       
# @Description : ws2812驱动

# ======================================== 导入相关模块 ========================================

# 导入硬件相关的模块
from machine import Pin
# 导入时间相关的模块
import time
# 导入RP2040相关的模块
import rp2

# ======================================== 全局变量 ============================================



# ======================================== 功能函数 ============================================

# 定义一个 asm_pio 函数,用于生成 PIO 程序
# 指定了 side-set 引脚的初始状态为低电平
# 指定了输出数据的移位方向为左移
# 使能autopull数据自动加载，自动加载阈值为24 位数据
@rp2.asm_pio(sideset_init=rp2.PIO.OUT_LOW,
             out_shiftdir=rp2.PIO.SHIFT_LEFT,
             autopull=True, pull_thresh=24)
def ws2812() -> None:
    """
    定义 WS2812 LED 驱动的 PIO 程序。

    Args:
        None

    Returns:
        None

    Description:
        该 PIO 程序用于驱动 WS2812 LED 灯带，通过状态机控制 LED 的颜色数据输出。
        程序通过 side-set 引脚输出高低电平信号，控制 LED 的亮灭。
    """
    # 标记程序的起始位置,当程序执行到 wrap() 时,会跳转回此处继续执行
    wrap_target()
    # 定义一个名为 bitloop 的标签,用于循环处理每个 LED 灯的数据
    label('bitloop')
    # 将寄存器 osr 中的 1 位数据输出到x寄存器，首先执行侧集操作设置侧集引脚为低电平 2 个周期
    out(x, 1).side(0)[2]
    # jmp 会判断 X 暂存器的值是不是 0，如果是0则跳转到 do_zero 标签
    # jmp 的 delay 会在做完条件判断后执行，所以总共会花 2 + 1 cycles
    jmp(not_x, 'do_zero').side(1)[2]
    # 如果 X 的值是 1，pioasm 会执行第三行
    # 这一行没有改变 side-set 的电位，所以继续维持高电位（3 + 1 cycles），并跳回 bitloop 标签
    jmp('bitloop')[3]
    # 定义一个名为 do_zero 的标签,用于处理 0 值的位
    label('do_zero')
    # 若 X 的值是 0，则会执行 nop()，并将 side-set 设为低电位，时间也是 3 + 1 cycles
    nop().side(0)[3]
    # 程序执行完毕后跳转回 wrap_target() 处继续执行
    wrap()

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================
