# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2024/7/27 下午9:52   
# @Author  : 李清水            
# @File    : main.py       
# @Description : 通过PIO控制NeoPixel灯带闪烁

# ======================================== 导入相关模块 ========================================

# 导入硬件相关的模块
from machine import Pin
# 导入时间相关的模块
import time
# 导入RP2040相关的模块
import rp2
import ws2812_driver

# ======================================== 全局变量 ============================================

# LED灯带的颜色列表
colors = [
    (128, 0, 0),    # LED 1，红色，亮度降低
    (128, 82, 0),   # LED 2，橙色，亮度降低
    (128, 128, 0),  # LED 3，黄色，亮度降低
    (0, 128, 0),    # LED 4，绿色，亮度降低
    (0, 128, 128),  # LED 5，青色，亮度降低
    (0, 0, 128),    # LED 6，蓝色，亮度降低
    (38, 0, 65),    # LED 7，紫色，亮度降低
    (119, 65, 119), # LED 8，紫罗兰色，亮度降低
    (128, 53, 90),  # LED 9，热粉色，亮度降低
    (128, 10, 74),  # LED 10，深粉色，亮度降低
    (128, 128, 128),# LED 11，白色，亮度降低
    (96, 96, 96),   # LED 12，银色，亮度降低
    (0, 0, 0),      # LED 13，黑色
    (64, 64, 64),   # LED 14，灰色，亮度降低
    (128, 0, 128),  # LED 15，品红色，亮度降低
    (128, 128, 128) # LED 16，白色，亮度降低
]

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# 上电延时3s
time.sleep(3)
# 打印调试信息
print("FreakStudio: Using PIO to control WS2812 LED")

# 初始化一个状态机对象,并将 ws2812 函数加载到状态机
# WS2812 的通信频率是 800 kHz，将其乘以10可得8 MHz (即一个WS2812时钟周期 = 10个PIO执行时钟周期)
sm = rp2.StateMachine(0, ws2812_drive.ws2812, freq=8000000, sideset_base=Pin(16))

# ========================================  主程序  ===========================================

# 启动状态机
sm.active(1)

while True:
    # 依次输出每个LED灯的颜色数据
    for r, g, b in colors:
        # 把红、绿、蓝三个值分别左移8位、16位、24位，然后相加转成一个 24-bit GRB值
        value = (g << 16) | (r << 8) | b
        # sm.put() 方法实际上会写入一个 32-bit 的数据到 FIFO
        # 写入 FIFO 时左移8位
        sm.put(value, 8)

    # 列表左移
    colors = colors[1:] + [colors[0]]

    # 延时200ms
    time.sleep_ms(200)